doc/test_results/ns/performance_mml.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            10042

Document Path:          /mml
Document Length:        365 bytes

Concurrency Level:      8
Time taken for tests:   0.387 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      113700 bytes
Total body sent:        16700
HTML transferred:       36500 bytes
Requests per second:    258.61 [#/sec] (mean)
Time per request:       30.934 [ms] (mean)
Time per request:       3.867 [ms] (mean, across all concurrent requests)
Transfer rate:          287.15 [Kbytes/sec] received
                        42.18 kb/s sent
                        329.33 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    21   30   4.5     30      54
Waiting:       21   30   4.4     30      54
Total:         22   30   4.5     30      54

Percentage of the requests served within a certain time (ms)
  50%     30
  66%     31
  75%     32
  80%     33
  90%     37
  95%     38
  98%     43
  99%     54
 100%     54 (longest request)