doc/test_results/ns/performance_png.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            10042

Document Path:          /png
Document Length:        170 bytes

Concurrency Level:      8
Time taken for tests:   0.379 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      90600 bytes
Total body sent:        16700
HTML transferred:       17000 bytes
Requests per second:    263.57 [#/sec] (mean)
Time per request:       30.352 [ms] (mean)
Time per request:       3.794 [ms] (mean, across all concurrent requests)
Transfer rate:          233.20 [Kbytes/sec] received
                        42.98 kb/s sent
                        276.19 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    17   30   5.7     29      66
Waiting:       17   29   5.7     28      65
Total:         17   30   5.7     29      66

Percentage of the requests served within a certain time (ms)
  50%     29
  66%     30
  75%     31
  80%     31
  90%     34
  95%     38
  98%     50
  99%     66
 100%     66 (longest request)