doc/test_results/ns/performance_png.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            10042

Document Path:          /png
Document Length:        1510 bytes

Concurrency Level:      8
Time taken for tests:   20.963 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      224700 bytes
Total body sent:        16700
HTML transferred:       151000 bytes
Requests per second:    4.77 [#/sec] (mean)
Time per request:       1677.075 [ms] (mean)
Time per request:       209.634 [ms] (mean, across all concurrent requests)
Transfer rate:          10.47 [Kbytes/sec] received
                        0.78 kb/s sent
                        11.25 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:   665 1609 872.0   1323    4122
Waiting:      665 1598 869.3   1323    4111
Total:        665 1609 872.0   1323    4122

Percentage of the requests served within a certain time (ms)
  50%   1323
  66%   1649
  75%   2225
  80%   2348
  90%   2926
  95%   3587
  98%   4024
  99%   4122
 100%   4122 (longest request)