doc/test_results/ns/performance_texvcinfo.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            10042

Document Path:          /texvcinfo
Document Length:        107 bytes

Concurrency Level:      8
Time taken for tests:   0.069 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      87300 bytes
Total body sent:        17300
HTML transferred:       10700 bytes
Requests per second:    1451.15 [#/sec] (mean)
Time per request:       5.513 [ms] (mean)
Time per request:       0.689 [ms] (mean, across all concurrent requests)
Transfer rate:          1237.16 [Kbytes/sec] received
                        245.16 kb/s sent
                        1482.32 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     2    5   3.0      4      16
Waiting:        2    5   2.9      4      15
Total:          2    5   3.0      4      16

Percentage of the requests served within a certain time (ms)
  50%      4
  66%      5
  75%      7
  80%      8
  90%     10
  95%     12
  98%     15
  99%     16
 100%     16 (longest request)